waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_can.h
#define    CAN_BTR_TS2_Pos                                        (4U)
#define    CAN_BTR_TS2_Msk                                        (0x7U << CAN_BTR_TS2_Pos)
#define    CAN_BTR_TS2                                            CAN_BTR_TS2_Msk

#define    CAN_BTR_TS1_Pos                                        (0U)
#define    CAN_BTR_TS1_Msk                                        (0xfU << CAN_BTR_TS1_Pos)
#define    CAN_BTR_TS1                                            CAN_BTR_TS1_Msk

#define    CAN_ECR_REC_Pos                                        (8U)
#define    CAN_ECR_REC_Msk                                        (0xffU << CAN_ECR_REC_Pos)
#define    CAN_ECR_REC                                            CAN_ECR_REC_Msk

#define    CAN_ECR_TEC_Pos                                        (0U)
#define    CAN_ECR_TEC_Msk                                        (0xffU << CAN_ECR_TEC_Pos)
#define    CAN_ECR_TEC                                            CAN_ECR_TEC_Msk

#define    CAN_ESR_OVLF_Pos                                       (8U)
#define    CAN_ESR_OVLF_Msk                                       (0x1U << CAN_ESR_OVLF_Pos)
#define    CAN_ESR_OVLF                                           CAN_ESR_OVLF_Msk

#define    CAN_ESR_BLF_Pos                                        (7U)
#define    CAN_ESR_BLF_Msk                                        (0x1U << CAN_ESR_BLF_Pos)
#define    CAN_ESR_BLF                                            CAN_ESR_BLF_Msk

#define    CAN_ESR_ADERR_Pos                                      (6U)
#define    CAN_ESR_ADERR_Msk                                      (0x1U << CAN_ESR_ADERR_Pos)
#define    CAN_ESR_ADERR                                          CAN_ESR_ADERR_Msk

#define    CAN_ESR_ACKER_Pos                                      (5U)
#define    CAN_ESR_ACKER_Msk                                      (0x1U << CAN_ESR_ACKER_Pos)
#define    CAN_ESR_ACKER                                          CAN_ESR_ACKER_Msk

#define    CAN_ESR_B0ERR_Pos                                      (4U)
#define    CAN_ESR_B0ERR_Msk                                      (0x1U << CAN_ESR_B0ERR_Pos)
#define    CAN_ESR_B0ERR                                          CAN_ESR_B0ERR_Msk

#define    CAN_ESR_B1ERR_Pos                                      (3U)
#define    CAN_ESR_B1ERR_Msk                                      (0x1U << CAN_ESR_B1ERR_Pos)
#define    CAN_ESR_B1ERR                                          CAN_ESR_B1ERR_Msk

#define    CAN_ESR_STER_Pos                                       (2U)
#define    CAN_ESR_STER_Msk                                       (0x1U << CAN_ESR_STER_Pos)
#define    CAN_ESR_STER                                           CAN_ESR_STER_Msk

#define    CAN_ESR_FMER_Pos                                       (1U)
#define    CAN_ESR_FMER_Msk                                       (0x1U << CAN_ESR_FMER_Pos)
#define    CAN_ESR_FMER                                           CAN_ESR_FMER_Msk

#define    CAN_ESR_CRCER_Pos                                      (0U)
#define    CAN_ESR_CRCER_Msk                                      (0x1U << CAN_ESR_CRCER_Pos)
#define    CAN_ESR_CRCER                                          CAN_ESR_CRCER_Msk

#define    CAN_SR_ACFBSY_Pos                                      (11U)
#define    CAN_SR_ACFBSY_Msk                                      (0x1U << CAN_SR_ACFBSY_Pos)
#define    CAN_SR_ACFBSY                                          CAN_SR_ACFBSY_Msk

#define    CAN_SR_RXFE_Pos                                        (10U)
#define    CAN_SR_RXFE_Msk                                        (0x1U << CAN_SR_RXFE_Pos)
#define    CAN_SR_RXFE                                            CAN_SR_RXFE_Msk

#define    CAN_SR_RSTS_Pos                                        (8U)
#define    CAN_SR_RSTS_Msk                                        (0x3U << CAN_SR_RSTS_Pos)
#define    CAN_SR_RSTS                                            CAN_SR_RSTS_Msk

#define    CAN_SR_TSTS_Pos                                        (6U)
#define    CAN_SR_TSTS_Msk                                        (0x3U << CAN_SR_TSTS_Pos)
#define    CAN_SR_TSTS                                            CAN_SR_TSTS_Msk

#define    CAN_SR_BBSY_Pos                                        (5U)
#define    CAN_SR_BBSY_Msk                                        (0x1U << CAN_SR_BBSY_Pos)
#define    CAN_SR_BBSY                                            CAN_SR_BBSY_Msk

#define    CAN_SR_BIDLE_Pos                                       (4U)
#define    CAN_SR_BIDLE_Msk                                       (0x1U << CAN_SR_BIDLE_Pos)
#define    CAN_SR_BIDLE                                           CAN_SR_BIDLE_Msk

#define    CAN_SR_NORMAL_Pos                                      (3U)
#define    CAN_SR_NORMAL_Msk                                      (0x1U << CAN_SR_NORMAL_Pos)
#define    CAN_SR_NORMAL                                          CAN_SR_NORMAL_Msk

#define    CAN_SR_SLEEP_Pos                                       (2U)
#define    CAN_SR_SLEEP_Msk                                       (0x1U << CAN_SR_SLEEP_Pos)
#define    CAN_SR_SLEEP                                           CAN_SR_SLEEP_Msk

#define    CAN_SR_LBACK_Pos                                       (1U)
#define    CAN_SR_LBACK_Msk                                       (0x1U << CAN_SR_LBACK_Pos)
#define    CAN_SR_LBACK                                           CAN_SR_LBACK_Msk

#define    CAN_SR_CONFIG_Pos                                      (0U)
#define    CAN_SR_CONFIG_Msk                                      (0x1U << CAN_SR_CONFIG_Pos)
#define    CAN_SR_CONFIG                                          CAN_SR_CONFIG_Msk

#define    CAN_RX_ISR_RXFIFO_MC_Pos                               (16U)
#define    CAN_RX_ISR_RXFIFO_MC_Msk                               (0xfU << CAN_RX_ISR_RXFIFO_MC_Pos)
#define    CAN_RX_ISR_RXFIFO_MC                                   CAN_RX_ISR_RXFIFO_MC_Msk

#define    CAN_RX_ISR_BORF_Pos                                    (12U)
#define    CAN_RX_ISR_BORF_Msk                                    (0x1U << CAN_RX_ISR_BORF_Pos)
#define    CAN_RX_ISR_BORF                                        CAN_RX_ISR_BORF_Msk

#define    CAN_RX_ISR_WUPF_Pos                                    (11U)
#define    CAN_RX_ISR_WUPF_Msk                                    (0x1U << CAN_RX_ISR_WUPF_Pos)
#define    CAN_RX_ISR_WUPF                                        CAN_RX_ISR_WUPF_Msk

#define    CAN_RX_ISR_SLPIF_Pos                                   (10U)
#define    CAN_RX_ISR_SLPIF_Msk                                   (0x1U << CAN_RX_ISR_SLPIF_Pos)
#define    CAN_RX_ISR_SLPIF                                       CAN_RX_ISR_SLPIF_Msk

#define    CAN_RX_ISR_ESCF_Pos                                    (9U)
#define    CAN_RX_ISR_ESCF_Msk                                    (0x1U << CAN_RX_ISR_ESCF_Pos)
#define    CAN_RX_ISR_ESCF                                        CAN_RX_ISR_ESCF_Msk

#define    CAN_RX_ISR_ERROR_Pos                                   (8U)
#define    CAN_RX_ISR_ERROR_Msk                                   (0x1U << CAN_RX_ISR_ERROR_Pos)
#define    CAN_RX_ISR_ERROR                                       CAN_RX_ISR_ERROR_Msk

#define    CAN_RX_ISR_RXNEMP_Pos                                  (7U)
#define    CAN_RX_ISR_RXNEMP_Msk                                  (0x1U << CAN_RX_ISR_RXNEMP_Pos)
#define    CAN_RX_ISR_RXNEMP                                      CAN_RX_ISR_RXNEMP_Msk

