waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_can.h
#define    CAN_RXFIDR_IDR_Pos                                     (0U)
#define    CAN_RXFIDR_IDR_Msk                                     (0xffffffffU << CAN_RXFIDR_IDR_Pos)
#define    CAN_RXFIDR_IDR                                         CAN_RXFIDR_IDR_Msk

#define    CAN_RXFDLCR_DLC_Pos                                    (0U)
#define    CAN_RXFDLCR_DLC_Msk                                    (0xfU << CAN_RXFDLCR_DLC_Pos)
#define    CAN_RXFDLCR_DLC                                        CAN_RXFDLCR_DLC_Msk

#define    CAN_RXFDW1R_DB_Pos                                     (0U)
#define    CAN_RXFDW1R_DB_Msk                                     (0xffffffffU << CAN_RXFDW1R_DB_Pos)
#define    CAN_RXFDW1R_DB                                         CAN_RXFDW1R_DB_Msk

#define    CAN_RXFDW2R_DB_Pos                                     (0U)
#define    CAN_RXFDW2R_DB_Msk                                     (0xffffffffU << CAN_RXFDW2R_DB_Pos)
#define    CAN_RXFDW2R_DB                                         CAN_RXFDW2R_DB_Msk

#define    CAN_AFCR_UAF_Pos                                       (0U)
#define    CAN_AFCR_UAF_Msk                                       (0x1U << CAN_AFCR_UAF_Pos)
#define    CAN_AFCR_UAF                                           CAN_AFCR_UAF_Msk

#define    CAN_AFCFGR_MSKM_Pos                                    (16U)
#define    CAN_AFCFGR_MSKM_Msk                                    (0x1U << CAN_AFCFGR_MSKM_Pos)
#define    CAN_AFCFGR_MSKM                                        CAN_AFCFGR_MSKM_Msk

#define    CAN_AFCFGR_FSC_Pos                                     (0U)
#define    CAN_AFCFGR_FSC_Msk                                     (0x1U << CAN_AFCFGR_FSC_Pos)
#define    CAN_AFCFGR_FSC                                         CAN_AFCFGR_FSC_Msk

#define    CAN_AFMR_AMRTR_Pos                                     (31U)
#define    CAN_AFMR_AMRTR_Msk                                     (0x1U << CAN_AFMR_AMRTR_Pos)
#define    CAN_AFMR_AMRTR                                         CAN_AFMR_AMRTR_Msk

#define    CAN_AFMR_AMID18_Pos                                    (13U)
#define    CAN_AFMR_AMID18_Msk                                    (0x3ffffU << CAN_AFMR_AMID18_Pos)
#define    CAN_AFMR_AMID18                                        CAN_AFMR_AMID18_Msk

#define    CAN_AFMR_AMIDE_Pos                                     (12U)
#define    CAN_AFMR_AMIDE_Msk                                     (0x1U << CAN_AFMR_AMIDE_Pos)
#define    CAN_AFMR_AMIDE                                         CAN_AFMR_AMIDE_Msk

#define    CAN_AFMR_AMSRR_Pos                                     (11U)
#define    CAN_AFMR_AMSRR_Msk                                     (0x1U << CAN_AFMR_AMSRR_Pos)
#define    CAN_AFMR_AMSRR                                         CAN_AFMR_AMSRR_Msk

#define    CAN_AFMR_AMID11_Pos                                    (0U)
#define    CAN_AFMR_AMID11_Msk                                    (0x7ffU << CAN_AFMR_AMID11_Pos)
#define    CAN_AFMR_AMID11                                        CAN_AFMR_AMID11_Msk

#define    CAN_AFMRSTD2_AMID3_Pos                                 (29U)
#define    CAN_AFMRSTD2_AMID3_Msk                                 (0x7U << CAN_AFMRSTD2_AMID3_Pos)
#define    CAN_AFMRSTD2_AMID3                                      CAN_AFMRSTD2_AMID3_Msk

#define    CAN_AFMRSTD2_AMIDE_Pos                                 (28U)
#define    CAN_AFMRSTD2_AMIDE_Msk                                 (0x1U << CAN_AFMRSTD2_AMIDE_Pos)
#define    CAN_AFMRSTD2_AMIDE                                      CAN_AFMRSTD2_AMIDE_Msk

#define    CAN_AFMRSTD2_AMSRR_Pos                                 (27U)
#define    CAN_AFMRSTD2_AMSRR_Msk                                 (0x1U << CAN_AFMRSTD2_AMSRR_Pos)
#define    CAN_AFMRSTD2_AMSRR                                      CAN_AFMRSTD2_AMSRR_Msk

#define    CAN_AFMRSTD2_AMID11_Pos                                (16U)
#define    CAN_AFMRSTD2_AMID11_Msk                                (0x7ffU << CAN_AFMRSTD2_AMID11_Pos)
#define    CAN_AFMRSTD2_AMID11                                     CAN_AFMRSTD2_AMID11_Msk

#define    CAN_AFMRSTD1_AMID3_Pos                                 (13U)
#define    CAN_AFMRSTD1_AMID3_Msk                                 (0x7U << CAN_AFMRSTD1_AMID3_Pos)
#define    CAN_AFMRSTD1_AMID3                                      CAN_AFMRSTD1_AMID3_Msk

#define    CAN_AFMRSTD1_AMIDE_Pos                                 (12U)
#define    CAN_AFMRSTD1_AMIDE_Msk                                 (0x1U << CAN_AFMRSTD1_AMIDE_Pos)
#define    CAN_AFMRSTD1_AMIDE                                     CAN_AFMRSTD1_AMIDE_Msk

#define    CAN_AFMRSTD1_AMSRR_Pos                                 (11U)
#define    CAN_AFMRSTD1_AMSRR_Msk                                 (0x1U << CAN_AFMRSTD1_AMSRR_Pos)
#define    CAN_AFMRSTD1_AMSRR                                      CAN_AFMRSTD1_AMSRR_Msk

#define    CAN_AFMRSTD1_AMID11_Pos                                (0U)
#define    CAN_AFMRSTD1_AMID11_Msk                                (0x7ffU << CAN_AFMRSTD1_AMID11_Pos)
#define    CAN_AFMRSTD1_AMID11                                    CAN_AFMRSTD1_AMID11_Msk

#define    CAN_AFIR_AIRTR_Pos                                     (31U)
#define    CAN_AFIR_AIRTR_Msk                                     (0x1U << CAN_AFIR_AIRTR_Pos)
#define    CAN_AFIR_AIRTR                                         CAN_AFIR_AIRTR_Msk

#define    CAN_AFIR_AIID18_Pos                                    (13U)
#define    CAN_AFIR_AIID18_Msk                                    (0x3ffffU << CAN_AFIR_AIID18_Pos)
#define    CAN_AFIR_AIID18                                        CAN_AFIR_AIID18_Msk

#define    CAN_AFIR_AIIDE_Pos                                     (12U)
#define    CAN_AFIR_AIIDE_Msk                                     (0x1U << CAN_AFIR_AIIDE_Pos)
#define    CAN_AFIR_AIIDE                                         CAN_AFIR_AIIDE_Msk

#define    CAN_AFIR_AISRR_Pos                                     (11U)
#define    CAN_AFIR_AISRR_Msk                                     (0x1U << CAN_AFIR_AISRR_Pos)
#define    CAN_AFIR_AISRR                                         CAN_AFIR_AISRR_Msk

#define    CAN_AFIR_AIID11_Pos                                    (0U)
#define    CAN_AFIR_AIID11_Msk                                    (0x7ffU << CAN_AFIR_AIID11_Pos)
#define    CAN_AFIR_AIID11                                        CAN_AFIR_AIID11_Msk

#define    CAN_AFIRSTD2_AIID3_Pos                                  (29U)
#define    CAN_AFIRSTD2_AIID3_Msk                                  (0x7U << CAN_AFIRSTD2_AIID3_Pos)
#define    CAN_AFIRSTD2_AIID3                                      CAN_AFIRSTD2_AIID3_Msk

#define    CAN_AFIRSTD2_AIIDE_Pos                                  (28U)
#define    CAN_AFIRSTD2_AIIDE_Msk                                  (0x1U << CAN_AFIRSTD2_AIIDE_Pos)
#define    CAN_AFIRSTD2_AIIDE                                      CAN_AFIRSTD2_AIIDE_Msk

#define    CAN_AFIRSTD2_AISRR_Pos                                  (27U)
#define    CAN_AFIRSTD2_AISRR_Msk                                  (0x1U << CAN_AFIRSTD2_AISRR_Pos)
#define    CAN_AFIRSTD2_AISRR                                      CAN_AFIRSTD2_AISRR_Msk

#define    CAN_AFIRSTD2_AIID11_Pos                                 (16U)
#define    CAN_AFIRSTD2_AIID11_Msk                                 (0x7ffU << CAN_AFIRSTD2_AIID11_Pos)
#define    CAN_AFIRSTD2_AIID11                                     CAN_AFIRSTD2_AIID11_Msk

