waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_can.h
/**
  * @brief    Get error status change interrupt flag
  * @rmtoll   RX_ISR    ESCF    FL_CAN_IsActiveFlag_ErrorChange
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ErrorChange(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_ESCF_Msk) == (CAN_RX_ISR_ESCF_Msk));
}

/**
  * @brief    Clear error status change interrupt flag
  * @rmtoll   RX_ISR    ESCF    FL_CAN_ClearFlag_ErrorChange
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_ErrorChange(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_ESCF_Msk);
}

/**
  * @brief    Get error interrupt  flag
  * @rmtoll   RX_ISR    ERROR    FL_CAN_IsActiveFlag_Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Error(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_ERROR_Msk) == (CAN_RX_ISR_ERROR_Msk));
}

/**
  * @brief    Clear error interrupt flag
  * @rmtoll   RX_ISR    ERROR    FL_CAN_ClearFlag_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Error(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_ERROR_Msk);
}

/**
  * @brief    Get receive FIFO not empty interrupt flag
  * @rmtoll   RX_ISR    RXNEMP    FL_CAN_IsActiveFlag_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXNotEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_RXNEMP_Msk) == (CAN_RX_ISR_RXNEMP_Msk));
}

/**
  * @brief    Clear receive FIFO not empty interrupt flag
  * @rmtoll   RX_ISR    RXNEMP    FL_CAN_ClearFlag_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXNotEmpty(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_RXNEMP_Msk);
}

/**
  * @brief    Get receive FIFO overflow interrupt flag
  * @rmtoll   RX_ISR    RXOFLW    FL_CAN_IsActiveFlag_RXOverflow
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXOverflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_RXOFLW_Msk) == (CAN_RX_ISR_RXOFLW_Msk));
}

/**
  * @brief    Clear  receive FIFO overflow interrupt flag
  * @rmtoll   RX_ISR    RXOFLW    FL_CAN_ClearFlag_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXOverflow(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_RXOFLW_Msk);
}

/**
  * @brief    Get receive FIFO empty interrupt flag
  * @rmtoll   RX_ISR    RXUFLW    FL_CAN_IsActiveFlag_RXEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXUnderflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_RXUFLW_Msk) == (CAN_RX_ISR_RXUFLW_Msk));
}

/**
  * @brief    Clear receive FIFO underflow interrupt flag
  * @rmtoll   RX_ISR    RXUFLW    FL_CAN_ClearFlag_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXUnderflow(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_RXUFLW_Msk);
}

/**
  * @brief    Get receive Ok interrupt flag
  * @rmtoll   RX_ISR    RXOK    FL_CAN_IsActiveFlag_RXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_RXOK_Msk) == (CAN_RX_ISR_RXOK_Msk));
}

/**
  * @brief    Clear receive OK interrupt flag
  * @rmtoll   RX_ISR    RXOK    FL_CAN_ClearFlag_CRXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXOK(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_RXOK_Msk);
}

/**
  * @brief    Get arbitration lost interrupt flag
  * @rmtoll   RX_ISR    ARBLST    FL_CAN_IsActiveFlag_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ArbitrationLost(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_ISR, CAN_RX_ISR_ARBLST_Msk) == (CAN_RX_ISR_ARBLST_Msk));
}

/**
  * @brief    Clear arbitration lost interrupt flag
  * @rmtoll   RX_ISR    ARBLST    FL_CAN_ClearFlag_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_ArbitrationLost(CAN_Type *CANx)
{
    WRITE_REG(CANx->RX_ISR, CAN_RX_ISR_ARBLST_Msk);
}

/**
  * @brief    Bus off recovery interrupt enable
  * @rmtoll   RX_IER    BORFIE    FL_CAN_EnableIT_BusOffRecovery
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_BusOffRecovery(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_BORFIE_Msk);
}

/**
  * @brief    Bus off recovery  interrupt enable status
  * @rmtoll   RX_IER    BORFIE    FL_CAN_IsEnabledIT_BusOffRecovery
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_BusOffRecovery(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_BORFIE_Msk) == CAN_RX_IER_BORFIE_Msk);
}

/**
  * @brief    Bus off recovery  interrupt disable
  * @rmtoll   RX_IER    BORFIE    FL_CAN_DisableIT_BusOffRecovery
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_BusOffRecovery(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_BORFIE_Msk);
}

/**
  * @brief    Wakeup interrupt enable
  * @rmtoll   RX_IER    WKUPIE    FL_CAN_EnableIT_Wakeup
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_Wakeup(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_WKUPIE_Msk);
}

/**
  * @brief    Wakeup  interrupt enable status
  * @rmtoll   RX_IER    WKUPIE    FL_CAN_IsEnabledIT_Wakeup
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_Wakeup(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_WKUPIE_Msk) == CAN_RX_IER_WKUPIE_Msk);
}

/**
  * @brief    Wakeup  interrupt disable
  * @rmtoll   RX_IER    WKUPIE    FL_CAN_DisableIT_Wakeup
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_Wakeup(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_WKUPIE_Msk);
}

/**
  * @brief    Sleep interrupt enable
  * @rmtoll   RX_IER    SLPIE    FL_CAN_EnableIT_Sleep
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_Sleep(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_SLPIE_Msk);
}

/**
  * @brief    Sleep  interrupt enable status
  * @rmtoll   RX_IER    SLPIE    FL_CAN_IsEnabledIT_Sleep
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_Sleep(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_SLPIE_Msk) == CAN_RX_IER_SLPIE_Msk);
}

/**
  * @brief    Sleep  interrupt disable
  * @rmtoll   RX_IER    SLPIE    FL_CAN_DisableIT_Sleep
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_Sleep(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_SLPIE_Msk);
}

/**
  * @brief    Error change interrupt enable
  * @rmtoll   RX_IER    EESCFIE    FL_CAN_EnableIT_ErrorChange
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_ErrorChange(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_EESCFIE_Msk);
}

/**
  * @brief    Get Error change  interrupt enable status
  * @rmtoll   RX_IER    EESCFIE    FL_CAN_IsEnabledIT_ErrorChange
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_ErrorChange(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_EESCFIE_Msk) == CAN_RX_IER_EESCFIE_Msk);
}

/**
  * @brief    Error change  interrupt disable
  * @rmtoll   RX_IER    EESCFIE    FL_CAN_DisableIT_ErrorChange
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_ErrorChange(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_EESCFIE_Msk);
}

/**
  * @brief    Error interrupt enable
  * @rmtoll   RX_IER    ERRORIE    FL_CAN_EnableIT_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_Error(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_ERRORIE_Msk);
}

/**
  * @brief    Get error interrupt enable status
  * @rmtoll   RX_IER    ERRORIE    FL_CAN_IsEnabledIT_Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_Error(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_ERRORIE_Msk) == CAN_RX_IER_ERRORIE_Msk);
}

/**
  * @brief    Error interrupt disable
  * @rmtoll   RX_IER    ERRORIE    FL_CAN_DisableIT_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_Error(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_ERRORIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt enable
  * @rmtoll   RX_IER    RXNEMPIE    FL_CAN_EnableIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXNotEmpty(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Get receive FIFO not empty interrupt enable status
  * @rmtoll   RX_IER    RXNEMPIE    FL_CAN_IsEnabledIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXNotEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_RXNEMPIE_Msk) == CAN_RX_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt disable
  * @rmtoll   RX_IER    RXNEMPIE    FL_CAN_DisableIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXNotEmpty(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt ennable
  * @rmtoll   RX_IER    RXOFLWIE    FL_CAN_EnableIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXOverflow(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO overflow interrupt enable status
  * @rmtoll   RX_IER    RXOFLWIE    FL_CAN_IsEnabledIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXOverflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_RXOFLWIE_Msk) == CAN_RX_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt disable
  * @rmtoll   RX_IER    RXOFLWIE    FL_CAN_DisableIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXOverflow(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO empty interrupt enable
  * @rmtoll   RX_IER    RXUFLWIE    FL_CAN_EnableIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXUnderflow(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_RXUFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO empty interrupt enable status
  * @rmtoll   RX_IER    RXUFLWIE    FL_CAN_IsEnabledIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXUnderflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_RXUFLWIE_Msk) == CAN_RX_IER_RXUFLWIE_Msk);
}

/**
  * @brief    Receive FIFO empty interrupt disable
  * @rmtoll   RX_IER    RXUFLWIE    FL_CAN_DisableIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXUnderflow(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_RXUFLWIE_Msk);
}

/**
  * @brief    Receive OK interrupt enable
  * @rmtoll   RX_IER    RXOKIE    FL_CAN_EnableIT_RXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXOK(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_RXOKIE_Msk);
}

/**
  * @brief    Get receive OK interrupt enable
  * @rmtoll   RX_IER    RXOKIE    FL_CAN_IsEnabledIT_RXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_RXOKIE_Msk) == CAN_RX_IER_RXOKIE_Msk);
}

/**
  * @brief    Receive OK interrupt disable
  * @rmtoll   RX_IER    RXOKIE    FL_CAN_DisableIT_RXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXOK(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_RXOKIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt enable
  * @rmtoll   RX_IER    ARBLSTIE    FL_CAN_EnableIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_ArbitrationLost(CAN_Type *CANx)
{
    SET_BIT(CANx->RX_IER, CAN_RX_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Get arbitration lost interrupt enable
  * @rmtoll   RX_IER    ARBLSTIE    FL_CAN_IsEnabledIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_ArbitrationLost(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RX_IER, CAN_RX_IER_ARBLSTIE_Msk) == CAN_RX_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt disable
  * @rmtoll   RX_IER    ARBLSTIE    FL_CAN_DisableIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_ArbitrationLost(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->RX_IER, CAN_RX_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Set Tx abort request
  * @rmtoll   TXBCR    TXAR    FL_CAN_SetTXAbortRequest
  * @param    CANx CAN instance
  * @param    buffer This parameter can be one of the following values:
  *           @arg @ref FL_CAN_TX_ABORT_NONE
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_1
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0AND1
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_2
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0AND2
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_1AND2
  *           @arg @ref FL_CAN_TX_ABORT_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_SetTXAbortRequest(CAN_Type *CANx, uint32_t bufferX)
{
    MODIFY_REG(CANx->TXB_CR, CAN_TXBCR_TXAR_Msk, bufferX);
}

/**
  * @brief    Get TX abort request
  * @rmtoll   TXBCR    TXAR    FL_CAN_GetTXAbortRequest
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_TX_ABORT_NONE
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_1
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0AND1
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_2
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_0AND2
  *           @arg @ref FL_CAN_TX_ABORT_BUFFER_1AND2
  *           @arg @ref FL_CAN_TX_ABORT_ALL
  */
__STATIC_INLINE uint32_t FL_CAN_GetTXAbortRequest(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXB_CR, CAN_TXBCR_TXAR_Msk));
}

/**
  * @brief    TX buffer empty interrupt enable
  * @rmtoll   TXBCR    TXIE    FL_CAN_EnableIT_TXBufferEmpty
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_TXBufferEmpty(CAN_Type *CANx, uint32_t bufferX)
{
    SET_BIT(CANx->TXB_CR, ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    Get TX buffer empty interrupt enable status
  * @rmtoll   TXBCR    TXIE    FL_CAN_IsEnabledIT_TXBufferEmpty
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_TXBufferEmpty(CAN_Type *CANx, uint32_t bufferX)
{
    return (uint32_t)(READ_BIT(CANx->TXB_CR, ((bufferX & 0x7U) << 0x0U)) == ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    TX buffer empty interrupt disable
  * @rmtoll   TXBCR    TXIE    FL_CAN_DisableIT_TXBufferEmpty
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_TXBufferEmpty(CAN_Type *CANx, uint32_t bufferX)
{
    CLEAR_BIT(CANx->TXB_CR, ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    Get TX result flag
  * @rmtoll   TXBSR    TXRF    FL_CAN_GetTXRsultFlag
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_TX_RESULT_NONE
  *           @arg @ref FL_CAN_TX_RESULT_ABORT
  *           @arg @ref FL_CAN_TX_RESULT_OK_NOABORT
  *           @arg @ref FL_CAN_TX_RESULT_OK_ABORT
  */
__STATIC_INLINE uint32_t FL_CAN_GetTXRsultFlag(CAN_Type *CANx, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER0)
    {
        return (uint32_t)(READ_BIT(CANx->TXB_SR, (CAN_TXBSR_TXRF_Msk << 0U)));
    }
    else
    {
        return (uint32_t)(READ_BIT(CANx->TXB_SR, (CAN_TXBSR_TXRF_Msk << bufferX)));
    }
}

/**
  * @brief    Get TX buffer status
  * @rmtoll   TXBSR    TXS    FL_CAN_GetTXBufferStatus
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_TX_BUFFER_ALL_IDLE
  *           @arg @ref FL_CAN_TX_BUFFER_0_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_1_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_0AND1_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_2_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_0AND2_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_1AND2_BUSY
  *           @arg @ref FL_CAN_TX_BUFFER_ALL_BUSY
  */
__STATIC_INLINE uint32_t FL_CAN_GetTXBufferStatus(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXB_SR, CAN_TXBSR_TXS_Msk));
}

/**
  * @brief    Clear TX buffer empty flag
  * @rmtoll   TXBSR    TXE    FL_CAN_ClearFlag_TXBufferEmpty
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  */
__STATIC_INLINE void FL_CAN_ClearFlag_TXBufferEmpty(CAN_Type *CANx, uint32_t bufferX)
{
    WRITE_REG(CANx->TXB_SR, (bufferX & 0x07U) << 0x0U);
}

/**
  * @brief    Get TX buffer empty flag
  * @rmtoll   TXBSR    TXE    FL_CAN_IsActiveFlag_TXBuffer1Empty
  * @param    CANx CAN instance
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXBufferEmpty(CAN_Type *CANx, uint32_t bufferX)
{
    return (uint32_t)(READ_BIT(CANx->TXB_SR, ((bufferX & 0x07U) << 0x0U)) == ((bufferX & 0x07) << 0x0U));
}

/**
  * @brief    Set TXFIFO message identifier code
  * @rmtoll   TXBIDR    IDR    FL_CAN_WriteTXMessageID
  * @param    CANx CAN instance
  * @param    id
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageID(CAN_Type *CANx, uint32_t id, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER2)
    {
        MODIFY_REG(*(&(CANx->TXB0_IDR) + 4 * (bufferX - 2)), CAN_TXBIDR_IDR_Msk, (id << CAN_TXBIDR_IDR_Pos));
    }
    else
    {
        MODIFY_REG(*(&(CANx->TXB0_IDR) + 4 * (bufferX - 1)), CAN_TXBIDR_IDR_Msk, (id << CAN_TXBIDR_IDR_Pos));
    }
}

/**
  * @brief    Get TXFIFO message identifier code
  * @rmtoll   TXBIDR    IDR    FL_CAN_ReadTXMessageID
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageID(CAN_Type *CANx, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(CANx->TXB0_IDR) + 4 * (bufferX - 2)), CAN_TXBIDR_IDR_Msk) >> CAN_TXBIDR_IDR_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(CANx->TXB0_IDR) + 4 * (bufferX - 1)), CAN_TXBIDR_IDR_Msk) >> CAN_TXBIDR_IDR_Pos);
    }
}

/**
  * @brief    Set TXFIFO data length code
  * @rmtoll   TXBDLCR    DLC    FL_CAN_WriteTXMessageLength
  * @param    CANx CAN instance
  * @param    length
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageLength(CAN_Type *CANx, uint32_t length, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER2)
    {
        MODIFY_REG(*(&(CANx->TXB0_DLCR) + 4 * (bufferX - 2)), CAN_TXBDLCR_DLC_Msk, (length << CAN_TXBDLCR_DLC_Pos));
    }
    else
    {
        MODIFY_REG(*(&(CANx->TXB0_DLCR) + 4 * (bufferX - 1)), CAN_TXBDLCR_DLC_Msk, (length << CAN_TXBDLCR_DLC_Pos));
    }
}

/**
  * @brief    Get TXFIFO data length code
  * @rmtoll   TXBDLCR    DLC    FL_CAN_ReadTXMessageLength
  * @param    CANx CAN instance
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageLength(CAN_Type *CANx, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(CANx->TXB0_DLCR) + 4 * (bufferX - 2)), CAN_TXBDLCR_DLC_Msk) >> CAN_TXBDLCR_DLC_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(CANx->TXB0_DLCR) + 4 * (bufferX - 1)), CAN_TXBDLCR_DLC_Msk) >> CAN_TXBDLCR_DLC_Pos);
    }
}

/**
  * @brief    Set TXFIFO data word1
  * @rmtoll   TXBDW1R    DB    FL_CAN_WriteTXMessageWord1
  * @param    CANx CAN instance
  * @param    word
  * @param    bufferX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_BUFFER0
  *           @arg @ref FL_CAN_BUFFER1
  *           @arg @ref FL_CAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageWord1(CAN_Type *CANx, uint32_t word, uint32_t bufferX)
{
    if(bufferX == FL_CAN_BUFFER2)
    {
        MODIFY_REG(*(&(CANx->TXB0_DW1R) + 4 * (bufferX - 2)), CAN_TXBDW1R_DB_Msk, (word << CAN_TXBDW1R_DB_Pos));
    }
    else
    {
        MODIFY_REG(*(&(CANx->TXB0_DW1R) + 4 * (bufferX - 1)), CAN_TXBDW1R_DB_Msk, (word << CAN_TXBDW1R_DB_Pos));
    }
}

